nxp-mcuxpresso/mcux-sdk/devices/MIMXRT533S/MIMXRT533S.h
/*
** ###################################################################
**     Processors:          MIMXRT533SFAWC
**                          MIMXRT533SFFOC
**
**     Compilers:           GNU C Compiler
**                          IAR ANSI C/C++ Compiler for ARM
**                          Keil ARM C/C++ Compiler
**                          MCUXpresso Compiler
**
**     Reference manual:    iMXRT500RM Rev.1, 07/2022
**     Version:             rev. 5.0, 2020-08-27
**     Build:               b220815
**
**     Abstract:
**         CMSIS Peripheral Access Layer for MIMXRT533S
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2022 NXP
**     All rights reserved.
**
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 1.0 (2019-04-19)
**         Initial version.
**     - rev. 2.0 (2019-07-22)
**         Base on rev 0.7 RM.
**     - rev. 3.0 (2020-03-16)
**         Base on Rev.A RM.
**     - rev. 4.0 (2020-05-18)
**         Base on Rev.B RM.
**     - rev. 5.0 (2020-08-27)
**         Base on Rev.C RM.
**
** ###################################################################
*/

/*!
 * @file MIMXRT533S.h
 * @version 5.0
 * @date 2020-08-27
 * @brief CMSIS Peripheral Access Layer for MIMXRT533S
 *
 * CMSIS Peripheral Access Layer for MIMXRT533S
 */

#ifndef _MIMXRT533S_H_
#define _MIMXRT533S_H_                           /**< Symbol preventing repeated inclusion */

/** Memory map major version (memory maps with equal major version number are
 * compatible) */
#define MCU_MEM_MAP_VERSION 0x0500U
/** Memory map minor version */
#define MCU_MEM_MAP_VERSION_MINOR 0x0000U


/* ----------------------------------------------------------------------------
   -- Interrupt vector numbers
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Interrupt_vector_numbers Interrupt vector numbers
 * @{
 */

/** Interrupt Number Definitions */
#define NUMBER_OF_INT_VECTORS 90                 /**< Number of interrupts in the Vector table */

typedef enum IRQn {
  /* Auxiliary constants */
  NotAvail_IRQn                = -128,             /**< Not available device specific interrupt */

  /* Core interrupts */
  NonMaskableInt_IRQn          = -14,              /**< Non Maskable Interrupt */
  HardFault_IRQn               = -13,              /**< Cortex-M33 SV Hard Fault Interrupt */
  MemoryManagement_IRQn        = -12,              /**< Cortex-M33 Memory Management Interrupt */
  BusFault_IRQn                = -11,              /**< Cortex-M33 Bus Fault Interrupt */
  UsageFault_IRQn              = -10,              /**< Cortex-M33 Usage Fault Interrupt */
  SecureFault_IRQn             = -9,               /**< Cortex-M33 Secure Fault Interrupt */
  SVCall_IRQn                  = -5,               /**< Cortex-M33 SV Call Interrupt */
  DebugMonitor_IRQn            = -4,               /**< Cortex-M33 Debug Monitor Interrupt */
  PendSV_IRQn                  = -2,               /**< Cortex-M33 Pend SV Interrupt */
  SysTick_IRQn                 = -1,               /**< Cortex-M33 System Tick Interrupt */

  /* Device specific interrupts */
  WDT0_IRQn                    = 0,                /**< Watchdog timer interrupt */
  DMA0_IRQn                    = 1,                /**< DMA interrupt */
  GPIO_INTA_IRQn               = 2,                /**< GPIO Interrupt A */
  GPIO_INTB_IRQn               = 3,                /**< GPIO Interrupt B */
  PIN_INT0_IRQn                = 4,                /**< General Purpose Input/Output interrupt 0 */
  PIN_INT1_IRQn                = 5,                /**< General Purpose Input/Output interrupt 1 */
  PIN_INT2_IRQn                = 6,                /**< General Purpose Input/Output interrupt 2 */
  PIN_INT3_IRQn                = 7,                /**< General Purpose Input/Output interrupt 3 */
  UTICK0_IRQn                  = 8,                /**< Micro-tick Timer */
  MRT0_IRQn                    = 9,                /**< Multi-Rate Timer */
  CTIMER0_IRQn                 = 10,               /**< Standard counter/timer CTIMER0 */
  CTIMER1_IRQn                 = 11,               /**< Standard counter/timer CTIMER1 */
  SCT0_IRQn                    = 12,               /**< SCTimer/PWM */
  CTIMER3_IRQn                 = 13,               /**< Standard counter/timer CTIMER3 */
  FLEXCOMM0_IRQn               = 14,               /**< FlexComm interrupt */
  FLEXCOMM1_IRQn               = 15,               /**< FlexComm interrupt */
  FLEXCOMM2_IRQn               = 16,               /**< FlexComm interrupt */
  FLEXCOMM3_IRQn               = 17,               /**< FlexComm interrupt */
  FLEXCOMM4_IRQn               = 18,               /**< FlexComm interrupt */
  FLEXCOMM5_IRQn               = 19,               /**< FlexComm interrupt */
  FLEXCOMM14_IRQn              = 20,               /**< FlexComm interrupt. Standalone SPI */
  FLEXCOMM15_IRQn              = 21,               /**< FlexComm interrupt. Standalone I2C */
  ADC0_IRQn                    = 22,               /**< Analog-to-Digital Converter interrupt */
  Reserved39_IRQn              = 23,               /**< Reserved interrupt */
  ACMP_IRQn                    = 24,               /**< Analog comparator Interrupts */
  DMIC0_IRQn                   = 25,               /**< Digital Microphone Interface interrupt */
  Reserved42_IRQn              = 26,               /**< Reserved interrupt */
  HYPERVISOR_IRQn              = 27,               /**< Hypervisor interrupt */
  SECURE_VIOLATION_IRQn        = 28,               /**< Secure violation interrupt */
  HWVAD0_IRQn                  = 29,               /**< Hardware Voice Activity Detector interrupt */
  Reserved46_IRQn              = 30,               /**< Reserved interrupt */
  RNG_IRQn                     = 31,               /**< Random Number Generator interrupt */
  RTC_IRQn                     = 32,               /**< Real Time Clock Alarm interrupt OR Wakeup timer interrupt */
  MU_A_IRQn                    = 34,               /**< Messaging Unit - Side A */
  PIN_INT4_IRQn                = 35,               /**< General Purpose Input/Output interrupt 4 */
  PIN_INT5_IRQn                = 36,               /**< General Purpose Input/Output interrupt 5 */
  PIN_INT6_IRQn                = 37,               /**< General Purpose Input/Output interrupt 6 */
  PIN_INT7_IRQn                = 38,               /**< General Purpose Input/Output interrupt 7 */
  CTIMER2_IRQn                 = 39,               /**< Standard counter/timer CTIMER2 */
  CTIMER4_IRQn                 = 40,               /**< Standard counter/timer CTIMER4 */
  OS_EVENT_IRQn                = 41,               /**< Event timer M33 Wakeup/interrupt */
  FLEXSPI0_FLEXSPI1_IRQn       = 42,               /**< FlexSPI0_IRQ OR FlexSPI1_IRQ */
  FLEXCOMM6_IRQn               = 43,               /**< FlexComm interrupt */
  FLEXCOMM7_IRQn               = 44,               /**< FlexComm interrupt */
  USDHC0_IRQn                  = 45,               /**< USDHC interrupt */
  USDHC1_IRQn                  = 46,               /**< USDHC interrupt */
  SGPIO_INTA_IRQn              = 47,               /**< Secure GPIO HS interrupt 0 */
  SGPIO_INTB_IRQn              = 48,               /**< Secure GPIO HS interrupt 1 */
  I3C0_IRQn                    = 49,               /**< Improved Inter Integrated Circuit 0 interrupt */
  USB0_IRQn                    = 50,               /**< USB device */
  USB0_NEEDCLK_IRQn            = 51,               /**< USB Activity Wake-up Interrupt */
  WDT1_IRQn                    = 52,               /**< Watchdog timer 1 interrupt */
  USB_PHYDCD_IRQn              = 53,               /**< USBPHY DCD interrupt */
  DMA1_IRQn                    = 54,               /**< DMA interrupt */
  PUF_IRQn                     = 55,               /**< QuidKey interrupt */
  POWERQUAD_IRQn               = 56,               /**< Powerquad interrupt */
  CASPER_IRQn                  = 57,               /**< Caspar interrupt */
  PMU_PMIC_IRQn                = 58,               /**< Power Management Control interrupt */
  HASHCRYPT_IRQn               = 59,               /**< SHA interrupt */
  FLEXCOMM8_IRQn               = 60,               /**< FlexComm interrupt */
  FLEXCOMM9_IRQn               = 61,               /**< FlexComm interrupt */
  FLEXCOMM10_IRQn              = 62,               /**< FlexComm interrupt */
  FLEXCOMM11_IRQn              = 63,               /**< FlexComm interrupt */
  FLEXCOMM12_IRQn              = 64,               /**< FlexComm interrupt */
  FLEXCOMM13_IRQn              = 65,               /**< FlexComm interrupt */
  FLEXCOMM16_IRQn              = 66,               /**< FlexComm interrupt */
  I3C1_IRQn                    = 67,               /**< Improved Inter Integrated Circuit 1 interrupt */
  FLEXIO_IRQn                  = 68,               /**< Flexible I/O interrupt */
  Reserved88_IRQn              = 72,
  SDMA_IRQn                    = 73                /**< Smart DMA Engine Controller interrupt */
} IRQn_Type;

/*!
 * @}
 */ /* end of group Interrupt_vector_numbers */


/* ----------------------------------------------------------------------------
   -- Cortex M33 Core Configuration
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Cortex_Core_Configuration Cortex M33 Core Configuration
 * @{
 */

